[
    {
        "title": "Azon"
    },
    {
        "audio": "adhan.mp3"
    },
    {
        "text": "Namozni uyda o‘qiydigan kishi yaqin atrofdan azon ovozini eshitmasa yoki yaqin atrofda masjid bo‘lmasa, azon aytishi sunnatdir. Namoz vaqti kirganda qiblaga yuzlanib azon aytiladi."
    },
    {
        "description": "Azon namoz vaqti kirganidan ogohlantiruvchi, namozga chorlovchi chaqiriqdir. Kundalik besh vaqt namoz va juma namozlari uchun azon va iqomat aytish ta'kidlangan sunnatdir.\r\n\r\nAzon namoz vaqti kirgach, tahorat bilan qiblaga yuzlanib, tik turgan holda ikki qo‘l ko‘rsatkich barmog‘ini quloq ichiga qo‘yib baland ovozda, dona- dona qilib aytiladi.\r\n\r\nMuazzin «Hayya ‘alas-solah» kalimasida boshini o‘ng tarafga, «Hayya ‘alal falah» kalimasida chap tarafga buradi.\r\n\r\nAzon kalimalari tartibi quyidagicha:\r\n1. «Allohu akbar» - 4 marta.\r\n2.«Ashhadu allaa ilaaha illalloh» - 2 marta.\r\n3. «Ashhadu anna Muhammadar Rasululloh» - 2 marta.\r\n4. «Hayya ‘alas-solah» - 2 marta.\r\n5. «Hayya ‘alal falah» - 2 marta.\r\n6. «As-solatu xoyrum minan-navm» - 2 marta.\r\n7. «Allohu akbar» - 2 marta.\r\n8. «Laa ilaaha illalloh» - 1 marta.\r\n\r\nIzoh: Bomdod namozida «Hayya ‘alal falah»dan so‘ng ikki marta «As-solatu xoyrum minan-navm» (Namoz uyqudan afzal) kalimasi qo‘shib aytiladi.\r\n\r\nAzonni eshitgan kishi ishdan, masjiddan boshqa tomonga yurishdan, so‘zlashdan to‘xtaydi. Muazzinning ortidan azon kalimalarini aytib turadi. Muazzin «Hayya ‘alas- solah», «Hayya ‘alal falah», deganida «Laa havla va laa quvvata illaa billahil ‘aliyyil a‘ziym», deydi.\r\n\r\nSafarda va jome' masjidlarida azon va iqomatni tark qilish makruh, biroq shahar ichidagi xonadonlarda ularni tark etish makruh emas.\r\n\r\nJunub kishining azon va iqomat aytishi, aqldan ozgan, fosiq, mast, tahoratsiz kishilar, aqlsiz bolalar va ayollarning azon aytishlari makruhdir. Shuningdek, juma namozidagi ikkinchi azondan boshqa azonlarni masjid ichida turib aytish ham makruhdir.\r\n\r\nAzon aytib bo‘lingach, uning quyidagi duosi o‘qiladi:\r\n\r\n«Allohumma, Robba haazihid-da'vatit- taammah, vas-solaatil qoimah. Aati Muhammadanil vasiylata val faziylah. Vab'ashu maqomam- mahmuudanillaziy va'adtah».\r\n\r\nIqomatning so‘zlari ham azonniki kabidir. Faqat «Hayya ‘alal falah»dan so‘ng ikki marta «Qod qomatis- solah» (Namoz boshlanib qoldi) kalimalari qo‘shib aytiladi. Iqomat farz namozlari oldidan aytiladi.\r\n\r\nQazo namozlari uchun azon va iqomat aytiladi. Hayit namozlari hamda janoza namoziga azon va iqomat aytilmaydi."
    }
]