[
    {
        "title": "Qa‘da"
    },
    {
        "audio": "audio8.mp3"
    },
    {
        "text": "Ikkinchi sajdani qilib boʻlganidan keyin chap oyoq ustiga oʻtirib, oʻng oyoqning barmoqlarini qiblaga qaratib oʻtiradi va tashahhud duosini o‘qiydi, keyin salovat aytib, duo qilib ikki tarafiga salom beradi."
    },
    {
        "description": "Oʻng qoʻlini oʻng soni ustiga, chap qoʻlini chap soni ustiga barmoqlarini yoygan holda qoʻyadi. Keyin tashahhud(attahiyot) duosini oʻqiydi.\r\n\r\nTashahhudning matni:\r\n \r\nالتَّحِيَّاتُ لِلّٰهِ، وَالصَّلَوْاتُ، وَالطَّيِّباتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللّٰهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللّٰهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُوْلُهُ \r\n\r\nOʻqilishi:\r\n\r\n«At-tahiyyaatu lillaahi vas-solavaatu vattoyyibaat. Assalaamu 'alayka ayyuhan-nabiyyu va rohmatulloohi va barokaatuh. Assalaamu 'alaynaa va a'laa 'ibaadil-laahis-soolihiyn. Ashhadu allaa ilaaha illalloohu va ashhadu anna Muhammadan 'abduhu va rosuluh». \r\n\r\nMa'nosi:\r\n\r\n«Salomlar Alloh uchundir, salavot va barcha go‘zal so‘zlar ham. Ey Nabiy! Senga salom, Allohning rahmati va barakalari bo‘lsin. Allohdan o‘zga ilohu ma‘bud yo‘q deb shahodat keltiraman. Albatta, Muhammad Uning bandasi va Rasuli deb shahodat keltiraman». \r\n\r\nSalovat:\r\n\r\nTashahhuddan keyin quyidagi salovatlar oʻqiladi:\r\n\r\n اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ \r\n\r\nOʻqilishi:\r\n\r\n«Alloohumma solli ‘alaa Muhammadin va ‘alaa aali Muhammad. Kamaa sollayta ‘alaa Ibrohiyma va ‘alaa aali Ibrohim. Innaka hamidum-majiyd. Alloohumma barik ‘alaa Muhammadin va ‘alaa aali Muhammad. Kamaa barokta ‘alaa Ibrohiyma va ‘alaa aali Ibrohim. Innaka hamidum-majiyd». \r\n\r\nMa’nosi:\r\n\r\nAllohim! Muhammad(alayhissalom)ga O‘zingning ziyoda rahmatlaringni nozil qilgin. Muhammadning oila a‘zolariga ham. Xuddi Ibrohimga va Ibrohimning oila a‘zolariga O‘z rahmatingni nozil qilganingdek. Albatta, Sening O‘zing maqtalgan, ulug‘langan Zotsan. Muhammadga va Muhammadning oila a‘zolariga o‘z barakangni nozil qil. \r\n\r\nDuo:\r\n\r\nSo‘ng Qur'on va Sunnatda kelgan duolardan biri o‘qiladi. Namuna sifatida quyida Qur'onda kelgan bir duoni keltiramiz: \r\n\r\nرَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا حَسَنَةً وَفِى ٱلْـَٔاخِرَةِ حَسَنَةً وَقِنَا عَذَابَ ٱلنَّارِ \r\n\r\nOʻqilishi:\r\n\r\nRobbanaa aatinaa fid-dunyaa hasanatan va fil aaxiroti hasanatan va qinaa ‘ azaaban-naar. \r\n\r\nMa’nosi:\r\n\r\nRobbimiz, bizga bu dunyoda ham yaxshilik ato etgin, oxiratda ham yaxshilik(ato etgin) va do‘zax azobidan asragin."
    },
    {
        "image": "man6.png"
    }
]