[
    {
        "description": "Janoza namozini ado qilishni niyat qildim. Allohim, oʻzingning roziligning uchun.",
        "full_description": "Masalan, “Xolis Alloh uchun janoza namozini oʻqishni niyat qildim” mazmunida niyat qilinadi. Imomga iqtido qilingan kishi iqtidosini ham niyat qiladi. Niyatni tilda aytsa yaxshi, dilda boʻlsa ham boʻladi.",
        "image": "2131230974.png",
        "title": "Niyat"
    },
    {
        "description": "Bosh barmoq quloqning yumshogʻiga tekkiziladi va takbir aytiladi «Allohu Akbar»",
        "full_description": "Ikki qoʻlimizni quloqlarimizning yumshogʻi barobariga koʻtaramiz. Bunda qoʻl koʻtarilganda qoʻllarimizning ichki yuzasini Ka'ba tomonga qilib, barmoqlarimizni erkin qoʻyamiz va “Allohu akbar” deymiz.\n\n“Allohu akbar” deganimizdan soʻng oʻng qoʻlimizning kafti bilan chap qoʻlimizning kafti tugagan joyini bir-biriga bogʻlab, kindik ostiga qoʻyamiz.",
        "image": "2131230975.png",
        "title": "Takbir"
    },
    {
        "description": "Keyin “Sano” duosi oʻqiladi",
        "full_description": "Sano duosi:\n\n سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ \n\nSubhaanakalloohumma va bihamdika va tabaarokasmuka va ta'aala jadduka va laa ilaaha g‘oyruk. \n\nMa‘nosi: «Allohim! Sening O‘zingni poklab yod etaman va Senga hamdu sano aytaman. Isming muborak bo‘ldi. Sha‘ning oliy bo‘ldi. Sendan boshqa ilohu ma‘bud yo‘q». \n\nSanoni imom ham, muqtadiy ham, yakka namozxon ham aytadi.",
        "image": "2131230976.png",
        "title": "Qiyom"
    },
    {
        "description": "Allohu Akbar",
        "full_description": "Sanodan keyingi takbirni imom jahriy aytadi. Bu takbirda qoʻllar koʻtarilmaydi. Iqtido qiluvchi imomni ortidan takbirlarni maxfiy aytadi.",
        "image": "2131230976.png",
        "title": "Takbir"
    },
    {
        "description": "Ikkinchi takbirda keyin salavot oʻqiladi",
        "full_description": "Keyin quyidagi salovatlar oʻqiladi:\n\n اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ \n\nOʻqilishi:\n\n«Alloohumma solli ‘alaa Muhammadin va ‘alaa aali Muhammad. Kamaa sollayta ‘alaa Ibrohiyma va ‘alaa aali Ibrohim. Innaka hamidum-majiyd. Alloohumma barik ‘alaa Muhammadin va ‘alaa aali Muhammad. Kamaa barokta ‘alaa Ibrohiyma va ‘alaa aali Ibrohim. Innaka hamidum-majiyd». \n\nMa’nosi:\n\nAllohim! Muhammad(alayhissalom)ga O‘zingning ziyoda rahmatlaringni nozil qilgin. Muhammadning oila a‘zolariga ham. Xuddi Ibrohimga va Ibrohimning oila a‘zolariga O‘z rahmatingni nozil qilganingdek. Albatta, Sening O‘zing maqtalgan, ulug‘langan Zotsan. Muhammadga va Muhammadning oila a‘zolariga o‘z barakangni nozil qil.",
        "image": "2131230976.png",
        "title": "Qiyom"
    },
    {
        "description": "Allohu Akbar",
        "full_description": "Salovatdan keyingi takbirni imom jahriy aytadi. Bu takbirda qo‘llar ko‘tarilmaydi. Iqtido qiluvchi imomni ortidan takbirlarni maxfiy aytadi.",
        "image": "2131230976.png",
        "title": "Takbir"
    },
    {
        "description": "Uchinchi takbirdan soʻng marhumning haqqiga janoza duosi oʻqiladi",
        "full_description": "Janoza duosi:\n\nAllohummag‘firliy hayyina va mayyitina va shahidina va g‘oibina va sog‘iyrina va kabiyrina va zakarina va unsana. Allohumma man ahyaytahu minna faahyihi ‘alal Islam. Va man tavaffaytu minna fatavaffahu ‘alal iyman. \n\nMa‘nosi:\n\n «Ey Rabbim! Tirigimizni va o‘ligimizni, bu yerda bo‘lganlarni va bo‘lmaganlarni, kichiklarimizni va kattalarimizni, erkak va ayollarimizni kechirgin. Allohim, Bizdan tug‘ilajak yangi nasllarni Islom dinida dunyoga keltir. Ajali yetib hayotdan ko‘z yumadiganlarning jonlarini imonli hollarida olgin».",
        "image": "2131230976.png",
        "title": "Qiyom"
    },
    {
        "description": "Allohu Akbar",
        "full_description": "Salovatdan keyingi takbirni imom jahriy aytadi. Bu takbirda qo‘llar ko‘tarilmaydi. Iqtido qiluvchi imomni ortidan takbirlarni maxfiy aytadi.",
        "image": "2131230976.png",
        "title": "Takbir"
    },
    {
        "description": "Soʻng «Assaalamu alaykum va rohmatulloh» deb, avval oʻng, soʻng chap tomoniga qarab salom berib namoz tugatiladi",
        "image": "2131230981.png",
        "title": "Salom"
    }
]