[
    {
        "description": "Жаноза намозини адо қилишни ният қилдим. Аллоҳим, ўзингнинг розилигнинг учун.",
        "full_description": "Масалан, “Холис Аллоҳ учун жаноза намозини ўқишни ният қилдим” мазмунида ният қилинади. Имомга иқтидо қилинган киши иқтидосини ҳам ният қилади. Ниятни тилда айтса яхши, дилда бўлса ҳам бўлади.",
        "image": "2131230974.png",
        "title": "Ният"
    },
    {
        "description": "Бош бармоқ қулоқнинг юмшоғига теккизилади ва такбир айтилади «Аллоҳу Акбар»",
        "full_description": "Икки қўлимизни қулоқларимизнинг юмшоғи баробарига кўтарамиз. Бунда қўл кўтарилганда қўлларимизнинг ички юзасини Каъба томонга қилиб, бармоқларимизни эркин қўямиз ва “Аллоҳу акбар” деймиз.\n\n“Аллоҳу акбар” деганимиздан сўнг ўнг қўлимизнинг кафти билан чап қўлимизнинг кафти тугаган жойини бир-бирига боғлаб, киндик остига қўямиз.",
        "image": "2131230975.png",
        "title": "Такбир"
    },
    {
        "description": "Кейин “Сано” дуоси ўқилади",
        "full_description": "Сано дуоси:\n\n سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ \n\nСубҳаанакаллооҳумма ва биҳамдика ва табаарокасмука ва таъаала жаддука ва лаа илааҳа ғойрук. \n\nМаъноси: «Аллоҳим! Сенинг Ўзингни поклаб ёд этаман ва Сенга ҳамду сано айтаман. Исминг муборак бўлди. Шаънинг олий бўлди. Сендан бошқа илоҳу маъбуд йўқ». \n\nСанони имом ҳам, муқтадий ҳам, якка намозхон ҳам айтади.",
        "image": "2131230976.png",
        "title": "Қиём"
    },
    {
        "description": "Аллоҳу Акбар",
        "full_description": "Санодан кейинги такбирни имом жаҳрий айтади. Бу такбирда қўллар кўтарилмайди. Иқтидо қилувчи имомни ортидан такбирларни махфий айтади.",
        "image": "2131230976.png",
        "title": "Такбир"
    },
    {
        "description": "Иккинчи такбирда кейин салавот ўқилади",
        "full_description": "Кейин қуйидаги саловатлар ўқилади:\n\n اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ \n\nЎқилиши:\n\n«Аллооҳумма солли 'алаа Муҳаммадин ва 'алаа аали Муҳаммад. Камаа соллайта 'алаа Иброҳийма ва 'алаа аали Иброҳим. Иннака ҳамидум-мажийд. Аллооҳумма барик 'алаа Муҳаммадин ва 'алаа аали Муҳаммад. Камаа барокта 'алаа Иброҳийма ва 'алаа аали Иброҳим. Иннака ҳамидум-мажийд». \n\nМаъноси:\n\nАллоҳим! Муҳаммад(алайҳиссалом)га Ўзингнинг зиёда раҳматларингни нозил қилгин. Муҳаммаднинг оила аъзоларига ҳам. Худди Иброҳимга ва Иброҳимнинг оила аъзоларига Ўз раҳматингни нозил қилганингдек. Албатта, Сенинг Ўзинг мақталган, улуғланган Зотсан. Муҳаммадга ва Муҳаммаднинг оила аъзоларига ўз баракангни нозил қил.",
        "image": "2131230976.png",
        "title": "Қиём"
    },
    {
        "description": "Аллоҳу Акбар",
        "full_description": "Саловатдан кейинги такбирни имом жаҳрий айтади. Бу такбирда қўллар кўтарилмайди. Иқтидо қилувчи имомни ортидан такбирларни махфий айтади.",
        "image": "2131230976.png",
        "title": "Такбир"
    },
    {
        "description": "Учинчи такбирдан сўнг марҳумнинг ҳаққига жаноза дуоси ўқилади",
        "full_description": "Жаноза дуоси:\n\nАллоҳуммағфирлий ҳаййина ва маййитина ва шаҳидина ва ғоибина ва соғийрина ва кабийрина ва закарина ва унсана. Аллоҳумма ман аҳяйтаҳу минна фааҳйиҳи 'алал Ислам. Ва ман таваффайту минна фатаваффаҳу 'алал ийман. \n\nМаъноси:\n\n «Эй Раббим! Тиригимизни ва ўлигимизни, бу ерда бўлганларни ва бўлмаганларни, кичикларимизни ва катталаримизни, эркак ва аёлларимизни кечиргин. Аллоҳим, Биздан туғилажак янги наслларни Ислом динида дунёга келтир. Ажали етиб ҳаётдан кўз юмадиганларнинг жонларини имонли ҳолларида олгин».",
        "image": "2131230976.png",
        "title": "Қиём"
    },
    {
        "description": "Аллоҳу Акбар",
        "full_description": "Саловатдан кейинги такбирни имом жаҳрий айтади. Бу такбирда қўллар кўтарилмайди. Иқтидо қилувчи имомни ортидан такбирларни махфий айтади.",
        "image": "2131230976.png",
        "title": "Такбир"
    },
    {
        "description": "Сўнг «Ассааламу алайкум ва роҳматуллоҳ» деб, аввал ўнг, сўнг чап томонига қараб салом бериб намоз тугатилади",
        "image": "2131230981.png",
        "title": "Салом"
    }
]